package tw.im.ncue.imking;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.util.Log;

// 資料功能類別
public class ItemDAO {
	// 表格名稱
	public static final String TABLE_NAME = "question";

	// 編號表格欄位名稱，固定不變
	public static final String KEY_ID = "_id";

	// 其它表格欄位名稱
	public static final String QUESTION = "question";
	public static final String ANSWER = "answer";
	public static final String OPTION1 = "option1";
	public static final String OPTION2 = "option2";
	public static final String OPTION3 = "option3";
	public static final String OPTION4 = "option4";

	// 使用上面宣告的變數建立表格的SQL指令
	public static final String CREATE_TABLE = "CREATE TABLE " + TABLE_NAME
			+ " (" + KEY_ID + " INTEGER PRIMARY KEY AUTOINCREMENT, " + QUESTION
			+ " TEXT NOT NULL, " + ANSWER + " TEXT NOT NULL, " + OPTION1
			+ " TEXT NOT NULL, " + OPTION2 + " TEXT NOT NULL, " + OPTION3
			+ " TEXT NOT NULL, " + OPTION4 + " TEXT NOT NULL)";

	// 資料庫物件
	private SQLiteDatabase db;

	// 建構子，一般的應用都不需要修改
	public ItemDAO(Context context) {
		db = MyDBHelper.getDatabase(context);
	}

	// 關閉資料庫，一般的應用都不需要修改
	public void close() {
		db.close();
	}

	// 新增物件
	public void addData(String question, String answer, String option1,
			String option2, String option3, String option4) {
		// 建立準備新增資料的ContentValues物件
		ContentValues cv = new ContentValues(6);
		cv.put("question", question);
		cv.put("answer", answer);
		cv.put("option1", option1);
		cv.put("option2", option2);
		cv.put("option3", option3);
		cv.put("option4", option4);

		db.insert(TABLE_NAME, null, cv); // 新增1筆記錄

	}

	// 取得指定編號的資料物件
	public QuestionItem getData(int id) {
		QuestionItem myItem;
		Cursor cursor = db.rawQuery("SELECT * FROM " + TABLE_NAME
				+ " WHERE _id LIKE " + id, null);

		cursor.moveToNext();
		myItem = new QuestionItem(cursor.getString(1), cursor.getString(2),
				cursor.getString(3), cursor.getString(4), cursor.getString(5),
				cursor.getString(6));

		return myItem;

	}

	public void initialize() {
		addData("142857 x 7 = ?","D","996999","997999","998999","999999");
		addData("唐太宗李世民的哥哥為下列何者？","B","李淵","李建成","李玄霸","李元吉");
		addData("下列何者並非台鐵的「特等站」？","C","台北","台中","台南","花蓮");
		addData("雪山隧道位在台灣哪一條國道上？","C","國道2號","國道3號","國道5號","國道6號");
		addData("下列何者為三國演義中「五虎上將」之一？","B","姜維"," 馬超","魏延","許褚");
		addData("關於保齡球「完全比賽」的敘述何者錯誤？","D","得分為300分","連續投出12次全倒（strike）","中途並未發生踩線犯規","計分格上的符號均為[/]");
		addData("第二季的英雄聯盟世界冠軍賽是誰？","C","TSM","AHQ","TPA","TFA");
		addData("儲水量最大的水庫？","A","曾文水庫","翡翠水庫","石門水庫","德基水庫");
		addData("人們常說失敗為成功之母，請問鄭成功的爸爸是誰?","B","鄭失敗","鄭芝龍","鄭克爽","鄭經");
		addData("你現在玩的遊戲名稱是？","D","知識王","資工王","益智王","資管王");
		addData("中華民國國旗有幾種顏色？","C","5","4","3","2");
		addData("七龍珠裡何著為賽亞人王子?","C","孫悟空","孫悟飯","達爾","龜仙人");
		addData("為了不破壞營養素，果汁適合在什麼溫度飲用?","A","10度C","15度C","20度C","25度C");
		addData("站在地球上往外空看是藍色的，跟電磁波的什麼作用最相關?","A","散射","輻射","折射","反射");
		addData("二十四孝中的賣身葬父是指何謂人物?","A","董永","黃庭堅","王祥","吳猛");
		addData("台灣面積最大的是哪一縣?","D","南投縣","高雄縣","台東縣","花蓮縣");
		addData("adobe軟體儲存的快捷鍵是？","C","ctrl+A","ctrl+X","ctrl+S","ctrl+V");
		addData("甄嬛傳裡的華妃有幾個孩子?","A","0","1","2","3");
		addData("肌樂可以噴幾次?","C","50","77","108","200");
		addData("榴槤跟西瓜打頭誰比較痛?","D","榴槤","西瓜","手","頭");
		addData("哪位藝人的口頭蟬是見鬼了?","D","周杰倫","康康","NONO","吳宗憲");
		addData("請問彰化某師範大學的英文簡稱叫什麼?","B","NKNU","NCUE","NTU","NTHU");
		addData("下列何者為台灣最強房仲產業公司?","B","東森房屋","信義房屋","永慶房屋","住商不動產");
		addData("「珈琲」的注音是⋯？","B","ㄎㄚ ㄈㄟ","ㄐㄧㄚ ㄅㄟˋ","ㄇㄚˇ ㄈㄟ","ㄑ一ㄝˊ ㄈㄟ");
		addData("南韓綜藝節目「Running Man」中，肌肉體格健壯，代表「老虎」的人是？","C","李光洙","姜Gary","金鍾國","宋智孝");
		addData("熱門人氣漫畫《幽遊白書》、《獵人》作者為冨樫義博，他的妻子是？","A","《美少女戰士》作者，武內直子","《鋼之煉金術士》作者，荒川弘","《櫻桃小丸子》作者，櫻桃子","《犬夜叉》作者，高橋留美子");
		addData("電影《復仇者聯盟2》，有在亞洲哪個國家取景？","C","台灣","日本","南韓","中國");
		addData("南韓綜藝節目「Running Man」中的最弱體，因鼻子最大，有王鼻子之稱的人是⋯？","A","池錫辰","蔡弦均","金鍾國","蔡鼻子");
		addData("哪一個國家的人民，是世界上平均身高最高的？","D","美國","台灣","澳洲","荷蘭");
		addData("2001年，全世界第一個立法承認同性婚姻的國家為下列何者？","A","荷蘭","瑞典","英國","澳洲");
		addData("下列哪位藝人任教於實踐大學?","B","蔡康永","曲家瑞","王丹","張兆志");
		addData("請問牙刷一般多久換一次?","A","三個月","五個月","六個月","兩個月");
		addData("請問米奇的褲子是什麼顏色","B","黑色","紅色","藍色","黃色");
		addData("請問被稱為5566的神曲為何","D","迷魂計","無所謂","傳說","我難過");
		addData("下列何者非唐宋八大家中，人稱「三蘇」之一?","B","蘇洵","蘇明","蘇轍","蘇軾");
		addData("唐宋八大家中有幾位是唐朝人?","D","5位","4位"," 3位 ","2位");
		addData("日本戰國時期有「第六天魔王」之稱為何人 ? ","A","織田信長","豐臣秀吉","武田信玄","德川家康");
		addData("日本史上的重要事件本能寺之變指的是誰的叛變?","D","羽柴秀吉","丹羽長秀","柴田勝家","明智光秀");
		addData("台灣知名電影KANO ，請問 KANO 是什麼意思?","B","棒球","嘉農","加油","冠軍 ");
		addData("哪位美國總統沒有死於暗殺?","D","亞伯拉罕·林肯","約翰·甘迺迪","威廉·麥金利","隆納·雷根 ");
		addData("希臘神話中，幫人類偷取了火的神是誰?","A","普羅米修斯","海克力斯","阿波羅","阿基里斯  ");
		addData("新版CPR口訣「叫叫CAB」，請問C代表什麼意思?胸外按壓心臟 B 人工呼吸 C 打開呼吸道 D 查看意識與呼吸 ","A","胸外按壓心臟","人工呼吸","打開呼吸道","查看意識與呼吸");
		addData("請問網路電影資料庫的英文簡稱為？","A","IMDb","MMDb","MODb","MVDb");
		addData("古龍小說絕代雙驕中的十大惡人實際上是多少人?","C","9人","10人","11人","12人");
		addData("英國披頭四(The Beatles)成員因肺癌去世的是誰?","A","喬治哈里遜","約翰藍儂","保羅麥卡尼","林哥史達");
		addData("下列哪部電影跟棒球沒有關係?","A","心靈捕手","心靈投手","魔球","紅粉聯盟");
		addData("在2015年即將上映第24部007電影，哪位演員演過最多次-詹姆士龐德?","B","史恩康納萊","羅傑摩爾","皮爾斯布洛斯南","丹尼爾克雷格");
		addData("杯酒釋兵權的典故來自哪位皇帝?","C","劉邦","朱元璋","趙匡胤","楊堅");
		addData("臺灣首度推出消防猛男月曆是哪個縣市的消防局？","B","台北市政府消防局","新北市政府消防局","新竹市政府消防局","台中市政府消防局");
		addData("陰屍路( The Walking Dead ) 第五季安全區域的名字為？","A","亞歷山大安全區","伍德布里安全區","格雷尼家安全區"," 亞特蘭大安全區");
		addData("一般人每日正常落髮量約為？","A","50~100根","1根","10~30根","150~200根");
		addData("代父從軍的花木蘭有幾個哥哥？","A","0","1","2","3");
		addData("韓國團體JYJ的成員誰最容易被欺負？","C","金在中","朴有天","金俊秀","金賢重");
		addData("動漫「銀魂」裡的角色「土方十四郎」最喜歡的食物是？","B","納豆","蛋黃醬","拉麵","蛋黃哥");
		addData("請問微軟專門為開發人員所提供的服務叫做什麼?","A","MSDN","BING","VLSC","Azure");
		addData("何者不是二十四孝的故事?","D","彩衣娛親","親嚐湯藥","哭竹生筍","孟母三遷");
		addData("銀魂裡新八的本體是什麼？","C","伊莉莎白","武士刀","眼鏡","嘣吉");
		addData("動漫「銀魂」中主角「坂田銀時」在攘夷時期的稱號是？","A","白夜叉","犬夜叉","母夜叉","廢物");
		addData("人體有70%是水組成的，那人腦有多少%的水組成?","C","0.6","0.7","0.8","0.9");
		addData("請問台灣的國花是?","B","櫻花","梅花","向日葵","香蕉");
		addData("2015甲級男籃冠軍是哪一隊？","A","松山高中","南山高中","新榮高中","能仁家商");
		addData("知名卡牌遊戲爐石戰記是以甚麼故事背景為主題?","B","星海爭霸","魔獸世界","英雄聯盟","暗黑破壞神");
		addData("在英雄聯盟中，最強悍的野怪是?","C","啾吉","小龍","巴龍","石像");
		addData("櫻桃小丸子中的班長是丸尾，副班長是誰?","A","美環","小丸子","花輪","大野");
		addData("下列哪個演員沒有飾演過楊過?","A","霍建華","黃曉明","劉德華","任賢齊");
		addData("「得之我幸，失之我命，如此而已。」一語出自何人之手?","B","金庸","徐志摩","張愛玲","九把刀");
		addData("動畫神奇寶貝中，皮卡丘特別喜歡什麼醬料?","D","咖哩醬","青醬","白醬","番茄醬");
		addData("哪個國家以「3C政策」擴張自己殖民統治的範圍","B","西班牙","英國","葡萄牙","法國");
		addData("童話繪本《小王子》的作者是?","C","雨果","小仲馬","聖艾修伯里","普魯斯特");
		addData("周杰倫的老婆是誰","B","Hebe","昆琳","蔡依林","蔡昆霖");
		addData("哈利波特鳳凰會的密令中，桃樂絲˙恩不里居沒有擔任過什麼職務？","C","霍格華茲校長","霍格華茲總督察","魔法執行部次長","黑魔法防禦術教師");
		addData("請問台北101總長大概是多少","D","500公尺","503公尺","505公尺","509公尺");
		addData("假設有一題四選一選擇題，甲乙兩人同時作答，問兩人選一樣的答案機率為多少","A","四分之一","二分之一","十六分之一","八分之一");
		addData("家樂福來自?","B","德國","法國","英國","美國");
		addData("泡麵是哪一國發明的?","A","日本","台灣","南韓","印度");
		addData("遊戲橘子旗下遊戲不包含下列何者?","A","淡水阿給","爆爆王","楓之谷","天堂");
		addData("中華職棒史上拿下最多次總冠軍的是哪支球隊?","C","義大犀牛","中信鯨","統一獅","兄弟象");
		addData("英雄聯盟一共有幾座防衛塔?","B","18","20","22","12");
		addData("英雄聯盟的英文名子是?","D","Laugh out Loudly","Lots of Luck","Legends of League","League of Legends");
		addData("動漫排球少年中，球場上的王者是誰？","A","影山飛雄","澤村大地","西谷夕","東峰旭");
		addData("動漫排球少年中，烏野高中排球隊隊長是誰？","B","影山飛雄","澤村大地","西谷夕","東峰旭");
		addData("動漫排球少年中，被日向稱為大王者的人是誰？","C","澤村大地","東峰旭","及川徹","影山飛雄");
		addData("動漫排球少年中，烏野的守護神是誰？","D","澤村大地","東峰旭","及川徹","西谷夕");
		addData("金庸小說「神鵰俠侶」陸無雙是哪個門派?","D","全真教","丐幫","桃花島","古墓派");
		addData("金庸小說「倚天屠龍記」張無忌他媽死前告訴她什麼?","C","回大都找我吧","有其父必有其子","越漂亮的女人越會騙人","活下去");
		addData("金庸小說「倚天屠龍記」張無忌他媽是誰?","B","黃蓉","殷素素","包惜弱","陸無雙");
		addData("金庸小說「神鵰俠侶」周伯通後來隱居何處?","D","桃花島","華山","","百花谷");
		addData("金庸小說第一次華山論劍與第二次華山論劍相距幾年？","D","10","15","20","25");
		addData("金庸小說中關於『喬峰』與『蕭峰』的敘述，下列何項正確？","C","兄弟","仇人","父子","兩人是同一人");
		addData("金庸小說，周伯通自創之空明拳共有幾路？","C","24","49","72","100");
		addData("俗稱的「龍涎香」實際上是?","D","麝香","一種草藥","鳥的糞便","鯨魚的嘔吐物");
		addData("電腦中儲存作業系統的是什麼?","A","硬碟","軟碟","CPU","風扇");
		addData("下列何者不是搜尋引擎？","C","Bing","Yahoo","Siri","Google");
		addData("請問運用粉末狀金屬或塑料等可粘合材料，通過逐層堆疊累積的方式來構造物體，此種技術稱為？","C","做假牙","蓋房子","3D列印","以上皆非");
		addData("據史書 張飛 怎死?","A","被部下所殺","喝酒而死","戰死沙場","自殺");
		addData("手機遊戲神魔之塔中，五大屬性為何？","C","水火草雷闇","金木水火土","水火木光暗","水火風雷土");
		addData("北極熊的皮膚是什麼顏色?","C","粉紅色","白色","黑色","皮膚色");
		addData("電視劇「奇皇后」是描述高麗人變成中國哪代皇后的故事？","C","宋朝","唐朝","元朝","清朝");
		addData("youtube點閱率最高的歌是哪一首","A","PSY - Gangnam Style","Adele - Rolling In The Deep","Lady Gaga - Bad Romance","Justin Bieber - Baby");
		addData("現今的國立彰化師範大學成立時的名稱為?","A","臺灣省立教育學院","彰化學院","國立臺灣教育學院","教師訓練所");
		addData("國立彰化師範大學現今有幾個學系?","C","18","20","21","23");
		addData("國立彰化師範大學現今有幾個學院?","D","3","5","6","7");
		addData("下列何者不是彰師大之校訓?","C","創新","務本","行力","專精");
		addData("請問目前彰師大校長是何人?","A","郭艶光","郭崇光","黃華山","江憲坤");
		addData("請問目前彰師大校長為何系之教授?","B","企管","物理","資管","國文");
		addData("彰師大的吉祥物為?","D","榕樹","獅子","麻雀","老鷹");
		addData("請問何者是教育部的反黑反毒反霸凌的代表花","B","茉莉花","紫錐花","菊花","百合花");
		addData("在商業概念中，\"SWOT\"的\"O\"代表甚麼意思?","B","優勢","機會","威脅","劣勢");
		addData("android 5.0版本的中文名稱?","B","甜甜圈","棒棒糖","可樂","棉花糖");
		addData("將有關資料進行一連串有計畫、有系統的處理的過程稱為？","D","資料管理","資訊處理","事務處理 ","資料處理");
		addData("PDA 是指下列何者?","C","個人電腦","個人文書處理器 ","個人數位助理","個人伺服器");
		addData("電子商務中，所謂的「B2C」是指下列何者的交易關係？","D","公司對公司","客戶對公司","客戶對客戶","公司對客戶");
		addData("製作積體電路晶片的材料是？","D","鋁","錳 ","鋼","矽");
		addData("在個人電腦中，磁碟機存取資料時，何者可為存取單位？","D","DPI","Sector","Track","Bit");
		addData("下列那一種記憶體內的資料會隨電源中斷而消失？","A","RAM","ROM","PROM","EPROM");
		addData("1MB 等於","A","1024 KB","1024 bytes","1024 GB","1024 TB");
		addData("一個位元組是由幾個位元所組成？","B","2","8","10","16");
		addData("下列何者不是作業系統？","B","Windows","Oracle","Unix","Linux");
		addData("下列何者是 UNIX 最具原創性的發明？","C","虛擬記憶體","管線化","多工","樹狀目錄結構");
		addData("下列何者常被當作 UNIX 系統下的管理者帳號？","B","admin","root","user","controller");
		addData("一般說來，下面那一種記憶體速度最快？","B","ROM","暫存器","快速記憶體","RAM");
		addData("圖像分辨率的單位是？","B","dpi","ppi","lpi","pixel");
		addData("photoshop裡，下列關於背景層的描述哪個是正確的？","B","可以設置圖層遮色版","不能上下移動，只能是最下面一層","不能轉為其他類型的圖層","不可以執行濾鏡效果");
		addData("目前彰師資管系共有幾位教授？","C","9","10","11","12");
		addData("電子商務的英文簡稱是什麼？","B","EQ","EC","AC","ED");
		addData("下列哪一個不屬於一般商業活動的四個層面之一？","D","商流","物流","金流","票務流");
		addData("下列哪一項商品可以利用電子商務來販賣？","D","實體商品","資訊與媒體商品","線上服務","以上皆可");
		addData("網站提供內容供消費者訂閱，並收取費是下列哪一種收益模式？","C","廣告收益模式","合作收益模式","訂閱收益模式","商業媒介收益模式");
		addData("下列何者不屬於電子商務的主要四個流(flow)？","B","金流","時尚流","商流","資訊流");
		addData("在網路保全的方式中，目前最常用的方式是？","D","DNA驗證","生物特徵辨識","主機保全","密碼設定");
		addData("internet 的前身是由哪個單位所發展出來的？","A","ARPANet","HiNet","SeedNet","TWNet");
		addData("網域名稱中，代表學校單位的是下列何者？","D","net","com","org","edu");
		addData("何者不屬於電子商務後端資料庫系統？","D","Oracle","MySQL","MS SQL","Linux");
		addData("Apache 是屬於？","A","網頁伺服器","資料庫伺服器","FTP 伺服器","SMTP 伺服器");
		addData("目前網際網路連線最常用的通訊協定是？","B","藍芽","TCP/IP","紅線外","NetBEUI");
		addData("HTTP 的預設連接埠(port)之值為何？","C","21","25","80","143");
		addData("全球資訊網(WWW)的文件主要使用下列哪一種格式？","B","純文字文件(.txt)","HTML 文件(.html)","可攜式文件(.pdf)","Word 文件(.doc)");
		addData("網際網路服務提供者的英文簡稱是？","C","ASP","JSP","ISP","PS2");
		addData("下列何者不是正確的 IP 位址？","A","257.25.26.22","101.101.101.101","168.95.1.1","127.0.0.1");
		addData("瀏覽器是用何種通訊協定與網頁伺服器進行溝通？","C","SMTP","FTP","HTTP","HTML");
		addData("大部份電子郵件「送信」時所使用的通訊協定為下列何者？","D","SNMP","POP3","HTTP","SMTP ");
		addData("下列何者標準定義了無線區域網路協定？","B","IEEE 802.20","IEEE 802.11","IEEE 802.15","IEEE 802.16");
		addData("「CRM」是指？","C","企業資源規劃","供應鏈管理","顧客關係管理","知識管理");
		addData("「ERP」是指？","A","企業資源規劃","供應鏈管理","顧客關係管理","知識管理");
		addData("「學習者透過電子媒介，來傳送學習內容」是指？","B","資料倉儲","數位學習","知識管理","資料探勘");
		addData("在顧客關係管理的成功要素中，最重要的是？","B","企業流程","人","科技","競爭者");
		addData("SWOT 分析中的「T」是指？","B","機會","威脅","優勢","劣勢");
		addData("SWOT 分析中的「W」是指？","D","機會","威脅","優勢","劣勢");
		addData("SWOT 分析中的「S」是指？","C","機會","威脅","優勢","劣勢");
		addData("下列何者不為行銷 STP？","A","價格","市場區隔","選擇目標市場","市場定位");
		addData("在網路上專門入侵別人電腦，加以破壞或竊取資料，這些人被稱為？","A","駭客","網路專家","釣客","酒客");
		addData("智慧財產權法，想要保護的是下列何者？","A","人類腦力辛勤創作的結晶","商業機密","商業利益","知的權利");
		addData("目前在網路上傳輸最佔用頻寬的是下列哪一種資料類型？","D","文字檔","圖形檔","音樂檔","視訊檔");
		addData("彰師大校必修學分為多少？","C","24","26","28","30");
	}

	// 取得資料數量
	public int getCount() {
		int result = 0;
		Cursor cursor = db.rawQuery("SELECT COUNT(*) FROM " + TABLE_NAME, null);

		if (cursor.moveToNext()) {
			result = cursor.getInt(0);
		}

		return result;
	}

}